; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v5 - type_3 ?v3 - type_2)
 	      (pred_3 ?v2 - object ?v3 - type_2)
	      (pred_4 ?v5 - type_3 ?v6 - type_1)
	      (pred_2 ?v5 - type_3 ?v2 - object ?v6 - type_1))

   (:action op_2
       :parameters  (?v5 - type_3 ?v8 ?v4 - type_2)
       :precondition (and  (pred_1 ?v5 ?v8))
       :effect (and  (pred_1 ?v5 ?v4)
		     (not (pred_1 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_3 ?v7 - object ?v1 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_3 ?v7 ?v1) (pred_1 ?v5 ?v1) (pred_4 ?v5 ?v6))
       :effect (and (pred_2 ?v5 ?v7 ?v6)
		    (not (pred_3 ?v7 ?v1)) 
		    (not (pred_4 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_3 ?v7 - object ?v1 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v7 ?v6) (pred_1 ?v5 ?v1))
       :effect (and (pred_3 ?v7 ?v1)
		    (pred_4 ?v5 ?v6)
		    (not (pred_2 ?v5 ?v7 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_06 - type_3
obj_12 obj_11 obj_09 obj_01 - type_1
obj_07 obj_02 obj_05 - type_2
obj_04 obj_10 obj_08 - object)
(:init
(pred_1 obj_03 obj_07)
(pred_4 obj_03 obj_12)
(pred_4 obj_03 obj_11)
(pred_1 obj_06 obj_07)
(pred_4 obj_06 obj_09)
(pred_4 obj_06 obj_01)
(pred_3 obj_04 obj_05)
(pred_3 obj_10 obj_02)
(pred_3 obj_08 obj_07)
)
(:goal
(and
(pred_3 obj_04 obj_07)
(pred_3 obj_10 obj_05)
(pred_3 obj_08 obj_02)
)
)

(:constraints
  (always (not (pred_1 obj_03 obj_05)))
)
)

; plan
1. (op_1 obj_03 obj_08 obj_07 obj_11)
   deleted: (pred_3 obj_08 obj_07) (pred_4 obj_03 obj_11)
   added: (pred_2 obj_03 obj_08 obj_11)
   goals met: 0 of 3
2. (op_2 obj_06 obj_07 obj_05)
   deleted: (pred_1 obj_06 obj_07)
   added: (pred_1 obj_06 obj_05)
   goals met: 0 of 3
3. (op_2 obj_03 obj_07 obj_02)
   deleted: (pred_1 obj_03 obj_07)
   added: (pred_1 obj_03 obj_02)
   goals met: 0 of 3
4. (op_1 obj_06 obj_04 obj_05 obj_01)
   deleted: (pred_3 obj_04 obj_05) (pred_4 obj_06 obj_01)
   added: (pred_2 obj_06 obj_04 obj_01)
   goals met: 0 of 3
5. (op_3 obj_03 obj_08 obj_02 obj_11)
   deleted: (pred_2 obj_03 obj_08 obj_11)
   added: (pred_3 obj_08 obj_02) (pred_4 obj_03 obj_11)
   goals met: 1 of 3
6. (op_2 obj_06 obj_05 obj_07)
   deleted: (pred_1 obj_06 obj_05)
   added: (pred_1 obj_06 obj_07)
   goals met: 1 of 3
7. (op_1 obj_03 obj_10 obj_02 obj_11)
   deleted: (pred_3 obj_10 obj_02) (pred_4 obj_03 obj_11)
   added: (pred_2 obj_03 obj_10 obj_11)
   goals met: 1 of 3
8. (op_3 obj_06 obj_04 obj_07 obj_01)
   deleted: (pred_2 obj_06 obj_04 obj_01)
   added: (pred_3 obj_04 obj_07) (pred_4 obj_06 obj_01)
   goals met: 2 of 3
9. (op_2 obj_06 obj_07 obj_02)
   deleted: (pred_1 obj_06 obj_07)
   added: (pred_1 obj_06 obj_02)
   goals met: 2 of 3
10. (op_3 obj_03 obj_10 obj_02 obj_11)
   deleted: (pred_2 obj_03 obj_10 obj_11)
   added: (pred_3 obj_10 obj_02) (pred_4 obj_03 obj_11)
   goals met: 2 of 3
11. (op_1 obj_06 obj_10 obj_02 obj_01)
   deleted: (pred_3 obj_10 obj_02) (pred_4 obj_06 obj_01)
   added: (pred_2 obj_06 obj_10 obj_01)
   goals met: 2 of 3
12. (op_2 obj_06 obj_02 obj_05)
   deleted: (pred_1 obj_06 obj_02)
   added: (pred_1 obj_06 obj_05)
   goals met: 2 of 3
13. (op_3 obj_06 obj_10 obj_05 obj_01)
   deleted: (pred_2 obj_06 obj_10 obj_01)
   added: (pred_3 obj_10 obj_05) (pred_4 obj_06 obj_01)
   goals met: 3 of 3
